0wQ/ch32x035-usb-wchlink/src/wchlink/target/rvswd_target_session.c
    for (uint8_t attempt = 0u; attempt < 3u; ++attempt) {
        uint32_t dmstatus;
        uint64_t halt_start;
        bool halted = false;

        // 官方 V307 抓包中最后一个 long STOP 到首个 short START 约为 212 us
        bsp_delay_us(200u);
        // 初始化帧的即时状态属于 DMI 管线，继续发送官方序列并以最终 halt 状态验收
        if (!rvswd_target_session_legacy_write_dmi(RVSWD_DMI_SHADOW, RVSWD_DEBUG_UNLOCK)) {
            rvswd_connect_last_error = 0xa1u;
            continue;
        }
        if (!rvswd_target_session_legacy_write_dmi(RVSWD_DMI_CONFIG, RVSWD_DEBUG_UNLOCK)) {
            rvswd_connect_last_error = 0xa2u;
            continue;
        }
        if (!rvswd_target_session_legacy_read_dmi(0x11u, &dmstatus)) {
            rvswd_connect_last_error = 0xa3u;
            continue;
        }

        // 官方 LinkE 连续写入两次 haltreq，随后轮询 allhalted 再访问 ChipID 和目标内存
        if (!rvswd_target_session_legacy_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u)) {
            rvswd_connect_last_error = 0xa4u;
            continue;
        }
        if (!rvswd_target_session_legacy_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u)) {
            rvswd_connect_last_error = 0xa5u;
            continue;
        }
        halt_start = bsp_time_us();
        do {
            if (!rvswd_target_session_legacy_read_dmi(0x11u, &dmstatus)) {
                rvswd_connect_last_error = 0xa6u;
                break;
            }
            if ((dmstatus & (1u << 9u)) != 0u) {
                halted = true;
                break;
            }
            bsp_delay_us(100u);
        } while ((bsp_time_us() - halt_start) < 100000u);
        if (!halted) {
            if (rvswd_connect_last_error != 0xa6u) {
                rvswd_connect_last_error = 0xa7u;
            }
            continue;
        }
        if (rvswd_target_session_legacy_identify_target()) {
            return true;
        }
        rvswd_connect_last_error = 0x13u;
    }
    return false;
}

static bool rvswd_target_session_legacy_connect(void) {
    rvswd_phy_gpio_set_fast_timing(false);
    if (rvswd_target_profile_from_family(rvswd_target_family_hint()) == NULL) {
        uint8_t status;
        uint8_t target_address;
        uint32_t target_data;
        uint16_t long_signature_count = 0u;

        // wlink status 使用通用 RISC-V 值 1，未知 family 先按官方 LinkE 序列自动识别
        // 自动识别先发送一个探测帧和 201 个轮询帧，再回到 short frame 连接 CH32
        rvswd_dmi_set_packet_mode(RVSWD_PACKET_LONG);
        // V30X 的长帧把 host parity 设为 operation 的奇偶校验位，CH5xx 长帧则固定为 0
        (void)rvswd_dmi_transaction_long(0u, 0x11u, 0x19u, 0u,
                                         &target_address, &target_data,
                                         &status);
        for (uint16_t probe = 0u; probe < 201u; ++probe) {
            (void)rvswd_dmi_transaction_long(1u, 0x11u, 0u, 1u,
                                             &target_address, &target_data,
                                             &status);
            if (target_address == 0x11u && status == RVSWD_LONG_STATUS_OK &&
                (target_data & 0x0fu) == 2u) {
                ++long_signature_count;
            }
        }
        rvswd_dmi_set_packet_mode(RVSWD_PACKET_SHORT);
        if (rvswd_try_connect_short_autodetect()) {
            return true;
        }
        if (long_signature_count >= 8u) {
            uint8_t short_error = rvswd_connect_last_error;

            rvswd_dmi_set_packet_mode(RVSWD_PACKET_LONG);
            if (rvswd_try_connect()) {
                return true;
            }
            rvswd_connect_last_error = short_error;
        }
        return false;
    }
    return rvswd_try_connect();
}

static uint8_t rvswd_target_session_legacy_connect_last_error(void) {
    return rvswd_connect_last_error;
}

static uint32_t rvswd_target_session_legacy_target_chip_id(void) {
    return rvswd_target_chip_id();
}

static void rvswd_target_session_legacy_set_target_wchlink_family_hint(uint8_t family) {
    rvswd_target_set_family_hint(family);
    rvswd_target_set_family_hint_active(false);
    rvswd_dmi_set_packet_mode(family == WCHLINK_TARGET_FAMILY_CH58X
                                  ? RVSWD_PACKET_LONG
                                  : RVSWD_PACKET_SHORT);
}

static uint8_t rvswd_target_session_legacy_target_wchlink_family(void) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();

    if (profile != NULL) {
        return profile->wchlink_family;
    }
    profile = rvswd_target_profile_from_family(rvswd_target_family_hint());
    return profile == NULL ? 0u : profile->wchlink_family;
}

static bool rvswd_target_session_legacy_target_supports_memory_streaming(void) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();

    return profile != NULL &&
           profile->memory_write_mode == RVSWD_MEMORY_WRITE_STREAMING;
}

static struct rvswd_target_result rvswd_target_session_invalid_result(void) {
    return rvswd_target_result_failure(RVSWD_TARGET_RESULT_CONNECT, 0x01u,
                                       false);
}

static struct rvswd_target_result rvswd_target_session_memory_result(
    struct rvswd_target_session *session, uint32_t address, bool success) {
    struct rvswd_target_result result;

    if (success) {
        result = rvswd_target_result_success();
    } else {
        result = rvswd_target_result_failure(
            RVSWD_TARGET_RESULT_MEMORY,
            rvswd_memory_last_error(),
            rvswd_dmi_failure_retryable());
        result.address = rvswd_memory_failure_address();
        result.dmi_status = rvswd_memory_failure_dmi_status();
        result.abstractcs = rvswd_memory_failure_abstractcs();
    }
    (void)session;
    if (!success && result.code == 0u) {
        result.code = 0x15u;
    }
    if (!success && result.address == 0u) {
        result.address = address;
    }
    return result;
}

void rvswd_target_session_init(struct rvswd_target_session *session) {
    if (session == NULL) {
        return;
    }
    memset(session, 0, sizeof(*session));
    rvswd_target_session_legacy_init();
}

