0wQ/ch32x035-usb-wchlink/src/wchlink/target/rvswd_target_session.c
void rvswd_target_session_disconnect(struct rvswd_target_session *session) {
    if (session == NULL) {
        return;
    }
    rvswd_target_session_legacy_disconnect();
    session->info.connected = false;
}

struct rvswd_target_result rvswd_target_session_connect(
    struct rvswd_target_session *session) {
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (rvswd_target_session_legacy_connect()) {
        session->connect_error = 0u;
        session->info.chip_id =
            rvswd_target_session_legacy_target_chip_id();
        session->info.family =
            rvswd_target_session_legacy_target_wchlink_family();
        session->info.profile = rvswd_target_profile_current();
        session->info.connected = session->info.profile != NULL;
        return rvswd_target_result_success();
    }

    session->connect_error =
        rvswd_target_session_legacy_connect_last_error();
    session->info.connected = false;
    result = rvswd_target_result_failure(RVSWD_TARGET_RESULT_CONNECT,
                                         session->connect_error, true);
    return result;
}

void rvswd_target_session_set_family_hint(
    struct rvswd_target_session *session, uint8_t family) {
    if (session == NULL) {
        return;
    }
    session->family_hint = family;
    rvswd_target_session_legacy_set_target_wchlink_family_hint(family);
    session->info.family = family;
    session->info.profile = rvswd_target_profile_from_family(family);
}

bool rvswd_target_session_is_connected(
    const struct rvswd_target_session *session) {
    return session != NULL && session->info.connected;
}

const struct rvswd_target_info *rvswd_target_session_info(
    const struct rvswd_target_session *session) {
    return session == NULL ? NULL : &session->info;
}

bool rvswd_target_session_supports_memory_streaming(
    const struct rvswd_target_session *session) {
    return session != NULL &&
           rvswd_target_session_legacy_target_supports_memory_streaming();
}

struct rvswd_target_result rvswd_target_session_read_dmi(
    struct rvswd_target_session *session, uint8_t address) {
    uint32_t value = 0u;
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (rvswd_target_session_legacy_read_dmi(address, &value)) {
        result = rvswd_target_result_success();
        result.value = value;
        return result;
    }
    return rvswd_target_result_failure(RVSWD_TARGET_RESULT_DMI,
                                       rvswd_dmi_last_status(),
                                       rvswd_target_session_legacy_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_write_dmi(
    struct rvswd_target_session *session, uint8_t address, uint32_t value) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (rvswd_target_session_legacy_write_dmi(address, value)) {
        return rvswd_target_result_success();
    }
    return rvswd_target_result_failure(RVSWD_TARGET_RESULT_DMI,
                                       rvswd_dmi_last_status(),
                                       rvswd_target_session_legacy_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_read_memory32(
    struct rvswd_target_session *session, uint32_t address) {
    uint32_t value = 0u;
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    result = rvswd_target_session_memory_result(
        session, address,
        rvswd_target_session_legacy_read_memory32(address, &value));
    if (result.ok) {
        result.value = value;
    }
    return result;
}

struct rvswd_target_result rvswd_target_session_write_memory32(
    struct rvswd_target_session *session, uint32_t address, uint32_t value) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_memory_result(
        session, address,
        rvswd_target_session_legacy_write_memory32(address, value));
}

struct rvswd_target_result rvswd_target_session_write_memory(
    struct rvswd_target_session *session, uint32_t address,
    const uint8_t *data, uint32_t length) {
    if (session == NULL || data == NULL || length == 0u) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_memory_result(
        session, address,
        rvswd_target_session_legacy_write_memory(address, data, length));
}

struct rvswd_target_result rvswd_target_session_write_register(
    struct rvswd_target_session *session, uint16_t regno, uint32_t value) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_legacy_write_register(regno, value)
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_DEBUG,
                                             rvswd_dmi_last_status(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_read_register(
    struct rvswd_target_session *session, uint16_t regno) {
    uint32_t value = 0u;
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (!rvswd_target_session_legacy_read_register(regno, &value)) {
        return rvswd_target_result_failure(RVSWD_TARGET_RESULT_DEBUG,
                                           rvswd_dmi_last_status(),
                                           rvswd_dmi_failure_retryable());
    }
    result = rvswd_target_result_success();
    result.value = value;
    return result;
}

struct rvswd_target_result rvswd_target_session_halt(
    struct rvswd_target_session *session) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_legacy_halt()
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_DEBUG,
                                             rvswd_dmi_last_status(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_execute(
    struct rvswd_target_session *session, uint32_t entry, uint32_t stack_top,
    uint32_t mode, uint32_t address, uint32_t length, uint32_t data_address) {
    uint32_t value = 0xffffffffu;
    struct rvswd_target_result result;
    bool success;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    success = rvswd_target_session_legacy_execute(entry, stack_top, mode,
                                                  address, length, data_address,
                                                  &value);
    result = success
                 ? rvswd_target_result_success()
                 : rvswd_target_result_failure(RVSWD_TARGET_RESULT_DEBUG,
                                               value == 0xffffffffu ? 0x15u : value,
                                               rvswd_dmi_failure_retryable());
    result.value = value;
    result.address = address;
    return result;
}

struct rvswd_target_result rvswd_target_session_reset_and_halt(
    struct rvswd_target_session *session) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_legacy_reset_and_halt()
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_RESET,
                                             rvswd_dmi_last_status(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_soft_reset_and_run(
    struct rvswd_target_session *session) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_legacy_soft_reset_and_run()
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_RESET,
                                             rvswd_dmi_last_status(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_reset_and_run(
    struct rvswd_target_session *session) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_target_session_legacy_reset_and_run()
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_RESET,
                                             rvswd_dmi_last_status(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_flash_erase_all(
    struct rvswd_target_session *session) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_flash_erase_all()
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_FLASH,
                                             rvswd_flash_last_error(),
                                             rvswd_dmi_failure_retryable());
}

