0wQ/ch32x035-usb-wchlink/src/wchlink/target/rvswd_target_session.c
struct rvswd_target_result rvswd_target_session_flash_rewrite_page(
    struct rvswd_target_session *session, uint32_t address,
    const uint8_t *data) {
    if (session == NULL || data == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_flash_rewrite_page(address, data)
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_FLASH,
                                             rvswd_flash_last_error(),
                                             rvswd_dmi_failure_retryable());
}

struct rvswd_target_result rvswd_target_session_flash_read_protected(
    struct rvswd_target_session *session) {
    bool value = false;
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (!rvswd_flash_read_protected(&value)) {
        return rvswd_target_result_failure(RVSWD_TARGET_RESULT_FLASH,
                                           rvswd_flash_last_error(),
                                           rvswd_dmi_failure_retryable());
    }
    result = rvswd_target_result_success();
    result.value = value ? 1u : 0u;
    return result;
}

struct rvswd_target_result rvswd_target_session_flash_write_protected(
    struct rvswd_target_session *session) {
    bool value = false;
    struct rvswd_target_result result;

    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    if (!rvswd_flash_write_protected(&value)) {
        return rvswd_target_result_failure(RVSWD_TARGET_RESULT_FLASH,
                                           rvswd_flash_last_error(),
                                           rvswd_dmi_failure_retryable());
    }
    result = rvswd_target_result_success();
    result.value = value ? 1u : 0u;
    return result;
}

struct rvswd_target_result rvswd_target_session_flash_set_read_protected(
    struct rvswd_target_session *session, bool protected) {
    if (session == NULL) {
        return rvswd_target_session_invalid_result();
    }
    return rvswd_flash_set_read_protected(protected)
               ? rvswd_target_result_success()
               : rvswd_target_result_failure(RVSWD_TARGET_RESULT_FLASH,
                                             rvswd_flash_last_error(),
                                             rvswd_dmi_failure_retryable());
}
